#### Dev Environment Plan 📖
<details><summary>Show Plan</summary>
```terraform
module.backend.stripe_product.vst["cool-synth-v1"]: Refreshing state... [id=prod_U1SInllK5crk4M]
module.backend.local_file.vst_config: Refreshing state... [id=42fbeba9537df670e6681404d6e34fb6893634c0]
module.backend.stripe_product.vst["retro-verb-v1"]: Refreshing state... [id=prod_U1SIEvbdLWIMKe]
module.backend.data.archive_file.stripe_layer_zip: Reading...
module.backend.data.archive_file.checkout_zip: Reading...
module.backend.data.archive_file.webhook_zip: Reading...
module.backend.data.archive_file.download_zip: Reading...
module.backend.data.archive_file.webhook_zip: Read complete after 0s [id=e9b02f517e52118061d145bcd703caedbc5e6858]
module.backend.data.archive_file.checkout_zip: Read complete after 0s [id=89858a795770ef58dc4c479873987033749c1728]
module.backend.data.archive_file.download_zip: Read complete after 0s [id=fbef8255c1eb83c043fba717bc78b76310fbb690]
module.backend.module.api_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-khqpyv-OPTIONS-200]
module.backend.module.api_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-khqpyv-OPTIONS]
module.backend.aws_api_gateway_resource.check_vst: Refreshing state... [id=khqpyv]
module.backend.aws_api_gateway_method.check_vst_get: Refreshing state... [id=agm-g6jnm33pu7-khqpyv-GET]
module.backend.module.api_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-khqpyv-OPTIONS]
module.backend.aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-g6jnm33pu7-khqpyv-GET]
module.backend.module.api_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-khqpyv-OPTIONS-200]
module.backend.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.backend.aws_lambda_function.vst_checker: Refreshing state... [id=vstshop-vst-checker-dev]
module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.frontend.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E1D4T2JQQTCZIX]
module.auth.aws_cognito_user_pool.pool: Refreshing state... [id=us-east-2_V9hhjw2Y5]
module.storage.aws_s3_bucket.vst_storage: Refreshing state... [id=vst-storage-dev-195481994910]
module.backend.aws_api_gateway_rest_api.api: Refreshing state... [id=g6jnm33pu7]
module.backend.data.archive_file.stripe_layer_zip: Read complete after 1s [id=47130cb3712c187fba0cbe3900760af490720a7c]
module.backend.aws_iam_role.lambda_role: Refreshing state... [id=vstshop-lambda-role-dev]
module.database.aws_dynamodb_table.purchases: Refreshing state... [id=vstshop-purchases-dev]
module.backend.stripe_price.vst_price["retro-verb-v1"]: Refreshing state... [id=price_1T3PNzDyEyPnHPBnBSi6RYWa]
module.backend.stripe_price.vst_price["cool-synth-v1"]: Refreshing state... [id=price_1T3PNzDyEyPnHPBnZfnovW9O]
module.backend.aws_lambda_layer_version.stripe_layer: Refreshing state... [id=arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:20]
module.backend.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-g6jnm33pu7-DEFAULT_4XX]
module.backend.aws_api_gateway_resource.webhook: Refreshing state... [id=uilktp]
module.backend.aws_api_gateway_resource.download: Refreshing state... [id=e02sjc]
module.backend.aws_api_gateway_resource.checkout: Refreshing state... [id=hghcjv]
module.backend.module.download_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-e02sjc-OPTIONS]
module.backend.aws_api_gateway_method.webhook_post: Refreshing state... [id=agm-g6jnm33pu7-uilktp-POST]
module.backend.module.checkout_cors.aws_api_gateway_method._: Refreshing state... [id=agm-g6jnm33pu7-hghcjv-OPTIONS]
module.backend.module.checkout_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-hghcjv-OPTIONS-200]
module.backend.module.checkout_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-hghcjv-OPTIONS]
module.backend.module.download_cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-g6jnm33pu7-e02sjc-OPTIONS-200]
module.backend.module.download_cors.aws_api_gateway_integration._: Refreshing state... [id=agi-g6jnm33pu7-e02sjc-OPTIONS]
module.backend.module.download_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-e02sjc-OPTIONS-200]
module.backend.module.checkout_cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-g6jnm33pu7-hghcjv-OPTIONS-200]
module.backend.aws_lambda_function.stripe_webhook: Refreshing state... [id=vstshop-stripe-webhook-dev]
module.auth.aws_cognito_user_pool_domain.main: Refreshing state... [id=vstshop-dev-vst-dev-123]
module.backend.aws_api_gateway_authorizer.cognito: Refreshing state... [id=7wqxx7]
module.backend.aws_api_gateway_method.download_get: Refreshing state... [id=agm-g6jnm33pu7-e02sjc-GET]
module.backend.aws_api_gateway_method.checkout_post: Refreshing state... [id=agm-g6jnm33pu7-hghcjv-POST]
module.backend.aws_lambda_permission.apigw_webhook: Refreshing state... [id=AllowExecutionFromAPIGatewayWebhook]
module.backend.aws_api_gateway_integration.webhook_integration: Refreshing state... [id=agi-g6jnm33pu7-uilktp-POST]
module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=vstshop-frontend-dev123]
module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E228GMNSTNHTAD]
module.storage.aws_s3_bucket_public_access_block.vst_storage_block: Refreshing state... [id=vst-storage-dev-195481994910]
module.backend.aws_iam_policy.lambda_combined_policy: Refreshing state... [id=arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.backend.aws_lambda_function.download: Refreshing state... [id=vstshop-download-dev]
module.frontend.aws_s3_bucket_policy.frontend_policy: Refreshing state... [id=vstshop-frontend-dev123]
module.storage.aws_s3_bucket_cors_configuration.vst_cors: Refreshing state... [id=vst-storage-dev-195481994910]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=2p1utd8g6jkts9qp59n7b5k9le]
module.backend.aws_lambda_function.checkout: Refreshing state... [id=vstshop-checkout-dev]
module.backend.aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=vstshop-lambda-role-dev/arn:aws:iam::195481994910:policy/vstshop-lambda-combined-policy-dev]
module.backend.aws_api_gateway_integration.download_integration: Refreshing state... [id=agi-g6jnm33pu7-e02sjc-GET]
module.backend.aws_lambda_permission.apigw_download: Refreshing state... [id=AllowExecutionFromAPIGatewayDownload]
module.backend.aws_lambda_permission.apigw_checkout: Refreshing state... [id=AllowExecutionFromAPIGatewayCheckout]
module.backend.aws_api_gateway_integration.checkout_integration: Refreshing state... [id=agi-g6jnm33pu7-hghcjv-POST]
module.backend.aws_api_gateway_deployment.deployment: Refreshing state... [id=9bxifz]
module.backend.aws_api_gateway_stage.this: Refreshing state... [id=ags-g6jnm33pu7-dev]
local_file.env_file: Refreshing state... [id=9ebf127f4251f8d1098d9b223024616c10c89532]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.env_file will be created
  + resource "local_file" "env_file" {
      + content              = <<-EOT
            VITE_AWS_REGION=us-east-2
            VITE_USER_POOL_ID=us-east-2_V9hhjw2Y5
            VITE_USER_POOL_CLIENT_ID=2p1utd8g6jkts9qp59n7b5k9le
            VITE_API_URL=https://g6jnm33pu7.execute-api.us-east-2.amazonaws.com/dev
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./../../../../services/vstshop-frontend/.env"
      + id                   = (known after apply)
    }

  # module.backend.aws_api_gateway_deployment.deployment must be replaced
+/- resource "aws_api_gateway_deployment" "deployment" {
      ~ created_date = "2026-02-22T00:38:15Z" -> (known after apply)
      ~ id           = "9bxifz" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "2b60bdf914e2e9d1453e2dbe5327538ff109c954"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.backend.aws_api_gateway_gateway_response.default_4xx will be updated in-place
  ~ resource "aws_api_gateway_gateway_response" "default_4xx" {
        id                  = "aggr-g6jnm33pu7-DEFAULT_4XX"
      ~ response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # module.backend.aws_api_gateway_integration.lambda_integration will be destroyed
  # (because aws_api_gateway_integration.lambda_integration is not in configuration)
  - resource "aws_api_gateway_integration" "lambda_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "khqpyv" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-g6jnm33pu7-khqpyv-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "us-east-2" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "khqpyv" -> null
      - response_transfer_mode  = "BUFFERED" -> null
      - rest_api_id             = "g6jnm33pu7" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:195481994910:function:vstshop-vst-checker-dev/invocations" -> null
        # (4 unchanged attributes hidden)
    }

  # module.backend.aws_api_gateway_method.check_vst_get will be destroyed
  # (because aws_api_gateway_method.check_vst_get is not in configuration)
  - resource "aws_api_gateway_method" "check_vst_get" {
      - api_key_required     = false -> null
      - authorization        = "COGNITO_USER_POOLS" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "7wqxx7" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-g6jnm33pu7-khqpyv-GET" -> null
      - region               = "us-east-2" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "khqpyv" -> null
      - rest_api_id          = "g6jnm33pu7" -> null
        # (2 unchanged attributes hidden)
    }

  # module.backend.aws_api_gateway_resource.check_vst will be destroyed
  # (because aws_api_gateway_resource.check_vst is not in configuration)
  - resource "aws_api_gateway_resource" "check_vst" {
      - id          = "khqpyv" -> null
      - parent_id   = "rv8oylouqe" -> null
      - path        = "/check-vst" -> null
      - path_part   = "check-vst" -> null
      - region      = "us-east-2" -> null
      - rest_api_id = "g6jnm33pu7" -> null
    }

  # module.backend.aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "9bxifz" -> (known after apply)
        id                    = "ags-g6jnm33pu7-dev"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # module.backend.aws_lambda_function.checkout will be updated in-place
  ~ resource "aws_lambda_function" "checkout" {
        id                             = "vstshop-checkout-dev"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:20",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_function.stripe_webhook will be updated in-place
  ~ resource "aws_lambda_function" "stripe_webhook" {
        id                             = "vstshop-stripe-webhook-dev"
      ~ layers                         = [
          - "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:20",
        ] -> (known after apply)
        tags                           = {}
        # (31 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.backend.aws_lambda_function.vst_checker will be destroyed
  # (because aws_lambda_function.vst_checker is not in configuration)
  - resource "aws_lambda_function" "vst_checker" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-2:195481994910:function:vstshop-vst-checker-dev" -> null
      - code_sha256                    = "2gyLZ/q06f0W6+g5PUkdHxg0JgB/glnCR2VaIQQ4Nwo=" -> null
      - filename                       = "../../../modules/vstshop/backend/lambda/lambda_function.zip" -> null
      - function_name                  = "vstshop-vst-checker-dev" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "vstshop-vst-checker-dev" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:195481994910:function:vstshop-vst-checker-dev/invocations" -> null
      - last_modified                  = "2026-02-18T22:51:35.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-2:195481994910:function:vstshop-vst-checker-dev:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:195481994910:function:vstshop-vst-checker-dev:$LATEST/invocations" -> null
      - region                         = "us-east-2" -> null
      - reserved_concurrent_executions = -1 -> null
      - response_streaming_invoke_arn  = "arn:aws:apigateway:us-east-2:lambda:path/2021-11-15/functions/arn:aws:lambda:us-east-2:195481994910:function:vstshop-vst-checker-dev/response-streaming-invocations" -> null
      - role                           = "arn:aws:iam::195481994910:role/vstshop-lambda-role-dev" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "2gyLZ/q06f0W6+g5PUkdHxg0JgB/glnCR2VaIQQ4Nwo=" -> null
      - source_code_size               = 1308 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null
        # (7 unchanged attributes hidden)

      - environment {
          - variables = {
              - "TABLE_NAME"      = "vstshop-purchases-dev"
              - "VST_BUCKET_NAME" = "vst-storage-dev-195481994910"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/vstshop-vst-checker-dev" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.backend.aws_lambda_layer_version.stripe_layer must be replaced
+/- resource "aws_lambda_layer_version" "stripe_layer" {
      ~ arn                         = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:20" -> (known after apply)
      ~ code_sha256                 = "KORYemCWlrUpAAN7ylid62BXKEpjOftvHB1V7MNC40o=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-02-22T00:38:09.232+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev:20" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-east-2:195481994910:layer:vstshop-stripe-layer-dev" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "KORYemCWlrUpAAN7ylid62BXKEpjOftvHB1V7MNC40o=" -> "nmOLpmWfw8G5ub8rP8yAl3QQKAEcSrH5plr4qO8p9mk=" # forces replacement
      ~ source_code_size            = 4678183 -> (known after apply)
      ~ version                     = "20" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.backend.aws_lambda_permission.apigw_lambda will be destroyed
  # (because aws_lambda_permission.apigw_lambda is not in configuration)
  - resource "aws_lambda_permission" "apigw_lambda" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "vstshop-vst-checker-dev" -> null
      - id                  = "AllowExecutionFromAPIGateway" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "us-east-2" -> null
      - source_arn          = "arn:aws:execute-api:us-east-2:195481994910:g6jnm33pu7/*/*" -> null
      - statement_id        = "AllowExecutionFromAPIGateway" -> null
        # (2 unchanged attributes hidden)
    }

  # module.backend.local_file.vst_config will be created
  + resource "local_file" "vst_config" {
      + content              = jsonencode(
            [
              + {
                  + id    = "cool-synth-v1"
                  + name  = "Cool Synth VST"
                  + price = "$29.99"
                },
              + {
                  + id    = "retro-verb-v1"
                  + name  = "Retro Verb VST"
                  + price = "$19.99"
                },
            ]
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../../modules/vstshop/backend/../../../../services/vstshop-frontend/src/product_config.json"
      + id                   = (known after apply)
    }

  # module.backend.module.api_cors.aws_api_gateway_integration._ will be destroyed
  # (because aws_api_gateway_integration._ is not in configuration)
  - resource "aws_api_gateway_integration" "_" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "khqpyv" -> null
      - connection_type         = "INTERNET" -> null
      - content_handling        = "CONVERT_TO_TEXT" -> null
      - http_method             = "OPTIONS" -> null
      - id                      = "agi-g6jnm33pu7-khqpyv-OPTIONS" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - region                  = "us-east-2" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = jsonencode(
                {
                  - statusCode = 200
                }
            )
        } -> null
      - resource_id             = "khqpyv" -> null
      - response_transfer_mode  = "BUFFERED" -> null
      - rest_api_id             = "g6jnm33pu7" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "MOCK" -> null
        # (5 unchanged attributes hidden)
    }

  # module.backend.module.api_cors.aws_api_gateway_integration_response._ will be destroyed
  # (because aws_api_gateway_integration_response._ is not in configuration)
  - resource "aws_api_gateway_integration_response" "_" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agir-g6jnm33pu7-khqpyv-OPTIONS-200" -> null
      - region              = "us-east-2" -> null
      - resource_id         = "khqpyv" -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          - "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          - "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          - "method.response.header.Access-Control-Max-Age"       = "'7200'"
        } -> null
      - response_templates  = {} -> null
      - rest_api_id         = "g6jnm33pu7" -> null
      - status_code         = "200" -> null
        # (2 unchanged attributes hidden)
    }

  # module.backend.module.api_cors.aws_api_gateway_method._ will be destroyed
  # (because aws_api_gateway_method._ is not in configuration)
  - resource "aws_api_gateway_method" "_" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "OPTIONS" -> null
      - id                   = "agm-g6jnm33pu7-khqpyv-OPTIONS" -> null
      - region               = "us-east-2" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "khqpyv" -> null
      - rest_api_id          = "g6jnm33pu7" -> null
        # (3 unchanged attributes hidden)
    }

  # module.backend.module.api_cors.aws_api_gateway_method_response._ will be destroyed
  # (because aws_api_gateway_method_response._ is not in configuration)
  - resource "aws_api_gateway_method_response" "_" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-g6jnm33pu7-khqpyv-OPTIONS-200" -> null
      - region              = "us-east-2" -> null
      - resource_id         = "khqpyv" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
          - "method.response.header.Access-Control-Max-Age"       = true
        } -> null
      - rest_api_id         = "g6jnm33pu7" -> null
      - status_code         = "200" -> null
    }

Plan: 4 to add, 4 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>